tests/coded_fixed_value_vadier_case/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
transportModel  Newtonian;
nu              nu [0 2 -1 0 0 0 0] 1.5e-05;
