tests/coded_fixed_value_vadier_case/0/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "INLET"
    {
        type            zeroGradient;
    }

    "OUTLET"
    {
        type            zeroGradient;
    }

    "WALLS"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "GROUND"
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    "TOP"
    {
        type            zeroGradient;
    }

}

// ************************************************************************* //
